.config/emacs/emacs.org
#+TITLE: Emacs Configuration
#+AUTHOR: Daniel Hwang
#+DESCRIPTION: Personal Emacs configuration
#+STARTUP: overview
* Early Init
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/early-init.el :mkdrip yes
;; early-init.el --- Emacs pre package.el & GUI configuration -*- lexical-binding: t; -*-
;; Code:

(setopt backup-inhibited t
	  make-backup-files nil
	  auto-save-default nil)

(setopt native-comp-async-report-warnings-errors nil)
;; Unneeded UI elemenets
(menu-bar-mode -1)
(tool-bar-mode -1)      
(scroll-bar-mode -1)    
(tooltip-mode -1)       
(set-fringe-mode 10)

(setopt inhibit-splash-screen t)
(setopt use-file-dialog nil)
  #+end_src
  
* Init
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/init.el
;; -*- lexical-binding: t; -*-

;; Add configuration modules to load path
(add-to-list 'load-path '"~/.dotfiles/.config/emacs/modules")

(setopt custom-file "~/.dotfiles/.config/emacs/custom.el")

;; Required Modules
(require 'el-package)
(require 'el-completion)
(require 'el-theme)
(require 'el-org)
(require 'el-ui)
(require 'el-dired)
(require 'el-eglot)
(require 'el-treesit)
(require 'el-flycheck)
(require 'el-magit)
(require 'modes)
(require 'terminal)
(require 'el-denote)

(when (daemonp)
  (use-package exec-path-from-shell)
  (exec-path-from-shell-initialize))

(setq-default create-lockfiles nil)
  #+end_src
  
* Emacs
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/init.el
(use-package emacs
  :init
  ;; Follow symlinks (for git dotfiles)
  (setopt vc-follow-symlinks t)
  ;; Frame height and width
  (add-to-list 'default-frame-alist '(height . 24))
  (add-to-list 'default-frame-alist '(width . 80))
  ;; Set tab width
  (setq-default tab-width 2)
  (setq-default indent-tabs-mode nil)
  :bind
  ("M-o" . other-window)
  ("C-x k" . 'kill-cur-buffer)
  ("C-c '" . org-edit-src-code)
  ("C-c c e" . 'config-edit)
  :hook
  ;; Enable line numbers for some modes
  ((prog-mode . display-line-numbers-mode)
   (conf-mode . display-line-numbers-mode))

  :config
  (set-face-attribute 'default nil
                      :family "Maple Mono NF"
                      :height 140)
  (set-face-attribute 'fixed-pitch nil
                      :family "Maple Mono NF"
                      )
  (set-face-attribute 'variable-pitch nil
                      :family "Atkinson Hyperlegible Next"
                      :height 160)

  (setopt scroll-conservatively 100)
  (setopt scroll-margin 4)

  (setopt org-src-window-setup 'current-window)

  (defun kill-cur-buffer ()
    (interactive)
    (kill-buffer (current-buffer)))

  (defun config-edit ()
    (interactive)
    (find-file "~/.dotfiles/.config/emacs/emacs.org"))
  (defalias 'yes-or-no-p 'y-or-n-p)

  :custom
  (tab-always-indent 'complete)
  (read-extended-command-predicate #'command-completion-default-include-p)
  (use-short-answers t)
  )
#+end_src

* Modeline
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/init.el
(setq-default mode-line-format
  '("%e"
     " %o "
     "%* "
     my-modeline-buffer-name
     my-modeline-major-mode))

(defvar-local my-modeline-buffer-name
  '(:eval
     (when (mode-line-window-selected-p)
       (propertize (format " %s " (buffer-name)))))
  "Mode line construct to display the buffer name.")

(put 'my-modeline-buffer-name 'risky-local-variable t)

(defvar-local my-modeline-major-mode
  '(:eval
     (list
       (propertize " λ" 'face 'shadow)
       " "
       (propertize (capitalize (symbol-name major-mode)) 'face 'bold)))
  "Mode line construct to display the major mode.")

(put 'my-modeline-major-mode 'risky-local-variable t)
#+end_src

* Ibuffer
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/init.el
(use-package ibuffer
  :ensure nil
  :bind
  ("C-x C-b" . ibuffer)
  :custom
  (ibuffer-use-other-window t)
 )
#+end_src

* Diminish
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/init.el
(use-package diminish
  :ensure t
  )
#+end_src

* which-key
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/init.el
(use-package which-key
  :diminish which-key-mode
  :hook (after-init . which-key-mode)
  :config
  (setopt which-key-idle-delay 0.3)
  ) 
#+end_src

* Use-Package
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-package.el :mkdirp yes
;; -*- lexical-binding: t; -*-
(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(eval-and-compile
  (setopt use-package-always-ensure t
	        use-package-expand-minimally t))

(provide 'el-package)
#+end_src

* Flycheck
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-flycheck.el
(use-package flycheck
  :ensure t
  :hook
  (prog-mode . flycheck-mode)
  )

(use-package flycheck-eglot
  :ensure t
  :after (flycheck eglot)
  :hook
  (prog-mode . flycheck-eglot-mode)
  )

(provide 'el-flycheck)
#+end_src

* Completion
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
;; -*- lexical-binding: t; -*-
#+end_src
** Savehist
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
(use-package savehist
  :ensure nil
  :hook (after-init . savehist-mode)
  )
#+end_src
** Consult
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
(use-package consult 
  :bind
  ("C-s" . consult-line)
  ("C-x b" . consult-buffer)
  :hook
  (completion-list-mode . consult-preview-at-point-mode)
  )
#+end_src

** Marginalia
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
(use-package marginalia
  :ensure t
  :hook (after-init . marginalia-mode)
  )
#+end_src

** Orderless
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
(use-package orderless
  :ensure t
  :config
  (setopt completion-styles '(orderless basic)
	        completion-category-defaults nil
	        completion-category-overrides '((file (styles partial-completion)))
	        )
  )
#+end_src

** Vertico
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
(use-package vertico
  :ensure t
  :hook (after-init . vertico-mode)
  )
  #+end_src
  
** Corfu
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
(use-package corfu
  :ensure t
  :hook (after-init . global-corfu-mode)
  :bind (:map corfu-map ("<tab>" . corfu-complete))
  :config
  (setopt tab-alwals-indent 'complete)
  (setopt corfu-preview-current nil)
  (setopt corfu-min-width 20)

  (setopt corfu-popupinto-delay '(1.25 . 0.5))
  (corfu-popupinfo-mode 1)

  (with-eval-after-load 'savehist
    (corfu-history-mode 1)
    (add-to-list 'savehist-additional-variables 'corfu-history))
  )
#+end_src

#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-completion.el
(provide 'el-completion)
#+end_src

* ef-themes
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-theme.el
  ;; -*- lexical-binding: t; -*-
  (use-package ef-themes
    :ensure t
    :init
    (ef-themes-take-over-modus-themes-mode 1)
    :config
    (setq modus-themes-mixed-fonts t)
    (setq modus-themes-italic-constructs t)
    (modus-themes-load-theme 'ef-owl)
    :bind
    (("<f5>" . ef-themes-rotate)
     ("C-<f5>" . ef-themes-select)
     ("M-<f5>" . ef-themes-load-random))
    )

  (provide 'el-theme)
#+end_src
  
* Dired
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-dired.el
;; -*- lexical-binding: t; -*-
(use-package dired
  :ensure nil
  :commands (dired)
  :hook
  (dired-mode . dired-hide-details-mode)
  (dired-mode . hl-line-mode)
  :config
  (setopt dired-recursive-copies 'always)
  (setopt dired-recursive-deletes 'always)
  (setopt delete-by-moving-to-trash t)
  (setopt dired-dwim-target t)
  )

(provide 'el-dired)

#+end_src

* Eglot
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-eglot.el
;; -*- lexical-binding: t; -*-
(use-package eglot
  :bind (:map eglot-mode-map
        ("C-c l a" . eglot-code-actions)
	      ("C-c l r" . eglot-rename)
	      ("C-c l h" . eldoc)
	      ("C-c l f" . eglot-format)
	      ("C-c l F" . eglot-format-buffer)
	      ("C-c l d" . xref-find-definitions-at-mouse)
	      ("C-c l R" . eglot-reconnect))
  :hook
  ((html-mode html-ts-code) . eglot-ensure)
  ((css-ts-mode css-mode) . eglot-ensure)
  ((go-mode go-ts-mode) . eglot-ensure)
  ((python-mode python-ts-mode) . eglot-ensure)
  (org-mode . eglot-ensure)
  :config
  (setq-default eglot-workspace-configuration
                '(:harper-ls (:linters (:SpellCheck t
                                                    :SentenceCapitalization :json-false
                                                    :LongSentences :json-false
                                                    :Spaces :json-false))))
  (add-to-list 'eglot-server-programs
               '(org-mode . ("harper-ls" "--stdio"))
               )
  :custom
  (eglot-autoshutdown t)
  )
(provide 'el-eglot)
#+end_src

* Org
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-org.el
;; -*- lexical-binding: t; -*-

(use-package org
  :init
  ;; org settings
  (setopt org-ellipsis " ")
  (setopt org-src-fontify-natively t)
  (setopt org-src-tab-acts-natively t)
  (setopt org-confirm-babel-evaluate nil)
  (setopt org-export-with-smart-quotes t)
  (setopt org-src-window-setup 'current-window)
  (setopt org-log-into-drawer t)
  (setopt org-hide-emphasis-markers t)
  :hook
  (org-mode . org-indent-mode)
  (org-mode . visual-line-mode)
  :config
  ;; org-agenda
  (setopt org-agenda-start-with-log-mode t)
  (setopt org-log-done 'time)
  ;; indentation
  (setopt org-edit-src-content-indentation 0
	        org-src-tab-acts-natively t
	        org-src-preserve-indentation t)
  ;; org-babel
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     )
   )
  )

;; (use-package org-roam
;;   :ensure t
;;   :custom
;;   (org-roam-directory "~/Documents/org")
;;   (org-roam-db-location "~/Documents/org/org-roam.db")
;;   (org-roam-completion-everywhere t)
;;   (org-roam-capture-templates
;;    '(("d" "default" plain
;;       "%?"
;;       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
;;       :unarrowed t))
;;    )
;;   :bind (("C-c r l" . org-roam-buffer-toggle)
;;          ("C-c r f" . org-roam-node-find)
;;          ("C-c r i" . org-roam-node-insert)
;;          ("C-c r c" . org-roam-node-capture)
;;          :map org-mode-map
;;          ("C-M-i" . completion-at-point)
;;          )
;;   :config
;;   (org-roam-setup)
;;   )

(use-package org-faces
  :ensure nil
  :after org
  :config
  ;; Resize Org headings
  (dolist (face '((org-level-1 . 1.4)
                  (org-level-2 . 1.3)
                  (org-level-3 . 1.2)
                  (org-level-4 . 1.1)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Atkinson Hyperlegible Next" :weight 'bold :height (cdr face)))
  )

(use-package org-tempo
  :ensure nil
  :after org
  :config
  (dolist (item '(("s" . "src")
                  ("el" . "src emacs-lisp")
                  ("p" . "src python")
                  ("g" . "src go")
                  )
                )
    (add-to-list 'org-structure-template-alist item))
  )

(provide 'el-org)
#+end_src

* Rainbow-delimiters
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-ui.el
;; -*- lexical-binding: t; -*-
(use-package rainbow-delimiters
  :hook
  (prog-mode . rainbow-delimiters-mode)
  )

(provide 'el-ui)
#+end_src

* Treesit
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-treesit.el
(use-package treesit
  :ensure nil
  :init
  (setopt treesit-language-source-alist
        '(
          (bash "https://github.com/tree-sitter/tree-sitter-bash")
          (css "https://github.com/tree-sitter/tree-sitter-css")
          (elisp "https://github.com/Wilfred/tree-sitter-elisp")
          (go "https://github.com/tree-sitter/tree-sitter-go") 
          (gomod "https://github.com/camdencheek/tree-sitter-go-mod")
          (html "https://github.com/tree-sitter/tree-sitter-html")
          (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
          (json "https://github.com/tree-sitter/tree-sitter-json")
          (make "https://github.com/alemuller/tree-sitter-make")
          (markdown "https://github.com/ikatyang/tree-sitter-markdown")
          (php "https://github.com/tree-sitter/tree-sitter-php" "master" "php/src")
          (python "https://github.com/tree-sitter/tree-sitter-python")
          (yaml "https://github.com/ikatyang/tree-sitter-yaml")
          )
        )
  )

(use-package treesit-auto
  :ensure t
  :hook (prog-mode . global-treesit-auto-mode)
  )

(provide 'el-treesit)
#+end_src

* Magit
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-magit.el
(use-package magit
  :ensure nil
  :init
  (message "Loading Magit!")
  :config
  (message "Loaded Magit!")
  :bind (("C-x g" . magit-status)
         ("C-x C-g" . magit-status))
  )

(provide 'el-magit)
#+end_src

* direnv
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/modes.el
(use-package direnv
  :hook
  (prog-mode . direnv-mode)
)
#+end_src

* go-mode
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/modes.el
(defun go-run-this-file ()
  "go run"
  (interactive)
  (compile (format "go run %s" (buffer-file-name))))

(defun go-compile ()
  "go compile"
  (interactive)
  (compile "go build -v && go test -v && go vet"))

(defun go-compile-debug ()
  "go compile with necessary flags to debug with gdb"
  (interactive)
  (compile "go build -gcflags=all=\" -N -l\""))

(use-package go-mode
  :ensure t
  :bind (:map go-mode-map
         ("C-c C-k" . go-run-this-file)
         ("C-c C-c" . go-compile)
         ("C-c C-d" . go-compile-debug))
  :hook ((before-save . eglot-format-buffer))
)

(provide 'modes)
#+end_src

* eat
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/terminal.el
(use-package eat
  :ensure t
  )
(provide 'terminal)
#+end_src

* denote
#+begin_src emacs-lisp :tangle ~/.dotfiles/.config/emacs/modules/el-denote.el
;; -*- lexical-binding: t; -*-

(use-package denote
  :ensure t
  :hook (dired-mode . denote-dired-mode)
  :bind
  (("C-c n n" . denote)
   ("C-c n r" . denote-rename-file)
   ("C-c n l" . denote-link)
   ("C-c n b" . denote-backlinks)
   ("C-c n d" . denote-dired)
   ("C-c n g" . denote-grep))
  :config
  (setq denote-directory (expand-file-name "~/Documents/notes/"))

  ;; Automatically rename Denote buffers when opening them so that
  ;; instead of their long file name they have, for example, a literal
  ;; "[D]" followed by the file's title.  Read the doc string of
  ;; `denote-rename-buffer-format' for how to modify this.
  (denote-rename-buffer-mode 1)
  )

(use-package denote-org
  :ensure t
  )

(provide 'el-denote)
#+end_src
